AlmAck/svdtonuttx/demo/h/da1470x_crg_top.h
#define DA1470X_CRG_TOP_BASE                       0x50000000 /* CRG_TOP registers */

#define DA1470X_CRG_TOP_ANA_STATUS                 (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_ANA_STATUS_OFFSET) /* Analog Signals Status Register */
#define DA1470X_CRG_TOP_BANDGAP                    (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_BANDGAP_OFFSET) /* bandgap trimming */
#define DA1470X_CRG_TOP_BIAS_VREF_SEL              (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_BIAS_VREF_SEL_OFFSET) /* No description available. */
#define DA1470X_CRG_TOP_BOD_CTRL                   (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_BOD_CTRL_OFFSET) /* Brown Out Detection control register */
#define DA1470X_CRG_TOP_BOD_STATUS                 (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_BOD_STATUS_OFFSET) /* No description available. */
#define DA1470X_CRG_TOP_CLK_AMBA                   (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_CLK_AMBA_OFFSET) /* HCLK, PCLK, divider and clock gates */
#define DA1470X_CRG_TOP_CLK_CMAC_SWITCH            (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_CLK_CMAC_SWITCH_OFFSET) /* Clock switching register for CMAC clock domain */
#define DA1470X_CRG_TOP_CLK_CTRL                   (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_CLK_CTRL_OFFSET) /* Clock control register */
#define DA1470X_CRG_TOP_CLK_RADIO                  (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_CLK_RADIO_OFFSET) /* Radio PLL control register */
#define DA1470X_CRG_TOP_CLK_RCHS                   (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_CLK_RCHS_OFFSET) /* Fast RC control register */
#define DA1470X_CRG_TOP_CLK_RCLP                   (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_CLK_RCLP_OFFSET) /* 32/512 kHz RC oscillator register */
#define DA1470X_CRG_TOP_CLK_RCX                    (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_CLK_RCX_OFFSET) /* RCX-oscillator control register */
#define DA1470X_CRG_TOP_CLK_RTCDIV                 (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_CLK_RTCDIV_OFFSET) /* Divisor for RTC 100Hz clock */
#define DA1470X_CRG_TOP_CLK_SNC_CTRL               (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_CLK_SNC_CTRL_OFFSET) /* No description available. */
#define DA1470X_CRG_TOP_CLK_SWITCH2XTAL            (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_CLK_SWITCH2XTAL_OFFSET) /* Switches clock from RC32M to XTAL32M */
#define DA1470X_CRG_TOP_CLK_TMR                    (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_CLK_TMR_OFFSET) /* Clock control for the timers */
#define DA1470X_CRG_TOP_CLK_XTAL32K                (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_CLK_XTAL32K_OFFSET) /* 32 kHz XTAL oscillator register */
#define DA1470X_CRG_TOP_DISCHARGE_RAIL             (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_DISCHARGE_RAIL_OFFSET) /* Immediate rail resetting. There is no LDO/DCDC gating */
#define DA1470X_CRG_TOP_LCD_EXT_CTRL               (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_LCD_EXT_CTRL_OFFSET) /* No description available. */
#define DA1470X_CRG_TOP_P0_PAD_LATCH               (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_P0_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470X_CRG_TOP_P0_RESET_PAD_LATCH         (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_P0_RESET_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470X_CRG_TOP_P0_SET_PAD_LATCH           (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_P0_SET_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470X_CRG_TOP_P1_PAD_LATCH               (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_P1_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470X_CRG_TOP_P1_RESET_PAD_LATCH         (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_P1_RESET_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470X_CRG_TOP_P1_SET_PAD_LATCH           (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_P1_SET_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470X_CRG_TOP_P2_PAD_LATCH               (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_P2_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470X_CRG_TOP_P2_RESET_PAD_LATCH         (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_P2_RESET_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470X_CRG_TOP_P2_SET_PAD_LATCH           (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_P2_SET_PAD_LATCH_OFFSET) /* Control the state retention of the GPIO ports */
#define DA1470X_CRG_TOP_PMU_CTRL                   (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_PMU_CTRL_OFFSET) /* Power Management Unit control register */
#define DA1470X_CRG_TOP_PMU_SLEEP                  (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_PMU_SLEEP_OFFSET) /* Configures the sleep/wakeup strategy */
#define DA1470X_CRG_TOP_POR_CTRL                   (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_POR_CTRL_OFFSET) /* Controls the POR on VBAT */
#define DA1470X_CRG_TOP_POR_PIN                    (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_POR_PIN_OFFSET) /* Selects a GPIO pin for POR generation */
#define DA1470X_CRG_TOP_POR_TIMER                  (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_POR_TIMER_OFFSET) /* Time for POR to happen */
#define DA1470X_CRG_TOP_POWER_CTRL                 (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_POWER_CTRL_OFFSET) /* Power control register */
#define DA1470X_CRG_TOP_POWER_LVL                  (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_POWER_LVL_OFFSET) /* No description available. */
#define DA1470X_CRG_TOP_RAM_PWR_CTRL               (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_RAM_PWR_CTRL_OFFSET) /* Control power state of System RAMS */
#define DA1470X_CRG_TOP_RESET_STAT                 (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_RESET_STAT_OFFSET) /* Reset status register */
#define DA1470X_CRG_TOP_RST_CTRL                   (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_RST_CTRL_OFFSET) /* Reset control register */
#define DA1470X_CRG_TOP_SECURE_BOOT                (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_SECURE_BOOT_OFFSET) /* Controls secure booting */
#define DA1470X_CRG_TOP_SLP_MAP                    (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_SLP_MAP_OFFSET) /* Map signals on GPIOs during sleep */
#define DA1470X_CRG_TOP_SW_V18F                    (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_SW_V18F_OFFSET) /* No description available. */
#define DA1470X_CRG_TOP_SYS_CTRL                   (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_SYS_CTRL_OFFSET) /* System Control register */
#define DA1470X_CRG_TOP_SYS_STAT                   (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_SYS_STAT_OFFSET) /* System status register */
#define DA1470X_CRG_TOP_VBUS_IRQ_CLEAR             (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_VBUS_IRQ_CLEAR_OFFSET) /* Clear pending IRQ register */
#define DA1470X_CRG_TOP_VBUS_IRQ_MASK              (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_VBUS_IRQ_MASK_OFFSET) /* IRQ masking */
#define DA1470X_CRG_TOP_WAKEUP_HIBERN              (DA1470X_CRG_TOP_BASE + DA1470X_CRG_TOP_WAKEUP_HIBERN_OFFSET) /* No description available. */

/* Register bit definitions *************************************************/


/* ANA_STATUS Register */

#define CRG_TOP_FLAG_LDO_V30_COMBINED_OK           (1U << 29) /* When high, ldo_v30 OR ldo_v30_ret is active (for VAD system) */
#define CRG_TOP_XOR_DOUT_WAKEUP_PADS               (1U << 28) /* Will be the result of XOR operation of the hibernation wake-up pads outputs comb */
#define CRG_TOP_VBUS_AVAILABLE                     (1U << 27) /* High when VBUS > ( VBAT + 150 mV). Hysteresis is approx. 40 mV */
#define CRG_TOP_FLAG_ADC_LDO_OK                    (1U << 26) /* When high, ldo_adc is active */
#define CRG_TOP_FLAG_IBIAS_TRIM                    (1U << 25) /* 10 nA Iref trimming, high when on-chip current is larger than reference current */
#define CRG_TOP_BOD_VIN_NOK                        (1U << 24) /* General output of the BOD to indicate that one of the monitored inputs is below  */
#define CRG_TOP_BG_OK                              (1U << 23) /* When high bandgap is active */
#define CRG_TOP_BOOST_DCDC_VLED_OK                 (1U << 22) /* When high, boost dcdc vled is active */
#define CRG_TOP_LDO_VSYS_HIGH_TEMP                 (1U << 21) /* If 1 indicates that temperature of LDO_VSYS is above operating conditions */
#define CRG_TOP_VBAT_VSYS_STATE_MASK               (0x3 << 19) /* 0x0 : Hibernation mode or VBUS-only ( sysbat switch opened). 0x1 : Test mode ( s */
#define CRG_TOP_VBAT_VSYS_STATE_POS                (19) /* 0x0 : Hibernation mode or VBUS-only ( sysbat switch opened). 0x1 : Test mode ( s */
#define CRG_TOP_LDO_VSYS_HEAD_LIM                  (1U << 18) /* When high, the headroom loop is controlling VSYS */
#define CRG_TOP_LDO_VSYS_CURR_LIM                  (1U << 17) /* When high, the current limiter is controlling VSYS */
#define CRG_TOP_LDO_VSYS_LIM                       (1U << 16) /* When high, the voltage loop is controlling VSYS */
#define CRG_TOP_LDO_VSYS_OK                        (1U << 15) /* When high, LDO_VSYS is in regulating mode */
#define CRG_TOP_LDO_V30_OK                         (1U << 13) /* When high, ldo_v30 is active */
#define CRG_TOP_SWITCH_V18F_OK                     (1U << 12) /* V18F switch completely closed */
#define CRG_TOP_BUCK_DCDC_V18P_OK                  (1U << 11) /* V18P Rail ok based on DCDC V18P programmed level */
#define CRG_TOP_BUCK_DCDC_V18_OK                   (1U << 10) /* V18 Rail ok based on DCDC V18 programmed level */
#define CRG_TOP_BUCK_DCDC_V14_OK                   (1U << 9) /* V14 Rail ok based on DCDC V14 programmed level */
#define CRG_TOP_BUCK_DCDC_V12_OK                   (1U << 8) /* V12 Rail ok based on DCDC V12 programmed level */
#define CRG_TOP_COMP_VBUS_PLUGIN                   (1U << 7) /* VBUS is connected (VBUS > 2.5 V) */
#define CRG_TOP_COMP_VSYS_NEAR_VLED                (1U << 6) /* BOOST_VLED_SEL=0x0 : VSYS>4.3 BOOST_VLED_SEL=0x1 : VSYS>4.55 BOOST_VLED_SEL=0x2  */
#define CRG_TOP_COMP_VBUS_ABOVE_VSYS               (1U << 5) /* VBUS>VSYS+0.05 V */
#define CRG_TOP_COMP_VSYS_OK                       (1U << 4) /* VSYS> 2.45 V */
#define CRG_TOP_COMP_VBAT_OK                       (1U << 3) /* VBAT> 2.7 V */
#define CRG_TOP_COMP_VBUS_OK                       (1U << 2) /* 1: VBUS> 4.1 V 0: VBUS<3.4 V */
#define CRG_TOP_POR_VSYS_OK                        (1U << 1) /* When high, VSYS is higher then POR threshold */
#define CRG_TOP_POR_V30_OK                         (1U << 0) /* When high, V30 is higher then POR threshold */

/* BANDGAP Register */

#define CRG_TOP_EN_BGR_TCCOMP                      (1U << 15) /* Enable Temperature compensation in the reference current for Charger and LED mod */
#define CRG_TOP_BANDGAP_ENABLE_CLAMP               (1U << 12) /* Enables a supply clamp inside the bandgap that improves PSRR. Should be enabled  */
#define CRG_TOP_BGR_TRIM_MASK                      (0x3F << 6) /* Trim register for bandgap */
#define CRG_TOP_BGR_TRIM_POS                       (6) /* Trim register for bandgap */
#define CRG_TOP_SYSRAM_LPMX                        (1U << 5) /* RAM Transparent Light Sleep (TLS) Core Enable for System RAMs and Cache RAM. Ass */
#define CRG_TOP_BGR_ITRIM_MASK                     (0x1F << 0) /* Current trimming for bias */
#define CRG_TOP_BGR_ITRIM_POS                      (0) /* Current trimming for bias */

/* BIAS_VREF_SEL Register */

#define CRG_TOP_BIAS_VREF_RF2_SEL_MASK             (0xF << 4) /* Same coding as BIAS_VREF_RF1_SEL. */
#define CRG_TOP_BIAS_VREF_RF2_SEL_POS              (4) /* Same coding as BIAS_VREF_RF1_SEL. */
#define CRG_TOP_BIAS_VREF_RF1_SEL_MASK             (0xF << 0) /* Vref_code | Vref_Voltage (mV) 0:900 1:930 2:960 3:990 4:1020 5:1050 6:1080 7:111 */
#define CRG_TOP_BIAS_VREF_RF1_SEL_POS              (0) /* Vref_code | Vref_Voltage (mV) 0:900 1:930 2:960 3:990 4:1020 5:1050 6:1080 7:111 */

/* BOD_CTRL Register */

#define CRG_TOP_BOD_VBUS_RST_EN                    (1U << 18) /* If set, generate power-on reset on channel VBUS */
#define CRG_TOP_BOD_VBAT_RST_EN                    (1U << 17) /* If set, generate power-on reset on channel VBAT. */
#define CRG_TOP_BOD_VSYS_RST_EN                    (1U << 15) /* If set, generate power-on reset on channel VSYS. Bear in mind that there is an a */
#define CRG_TOP_BOD_V18F_RST_EN                    (1U << 14) /* If set, generate power-on reset on channel V18F */
#define CRG_TOP_BOD_V18P_RST_EN                    (1U << 13) /* If set, generate power-on reset on channel V18P */
#define CRG_TOP_BOD_V18_RST_EN                     (1U << 12) /* If set, generate power-on reset on channel V18 */
#define CRG_TOP_BOD_V14_RST_EN                     (1U << 11) /* If set, generate power-on reset on channel V14 */
#define CRG_TOP_BOD_V12_RST_EN                     (1U << 10) /* If set, generate power-on reset on channel V12 */
#define CRG_TOP_BOD_VBUS_EN                        (1U << 9) /* Enable brown-out detection for channel VBUS */
#define CRG_TOP_BOD_VBAT_EN                        (1U << 8) /* Enable brown-out detection for channel VBAT. */
#define CRG_TOP_BOD_VSYS_EN                        (1U << 6) /* Enable brown-out detection for channel VSYS. Bear in mind that there is an addit */
#define CRG_TOP_BOD_V18F_EN                        (1U << 5) /* Enable brown-out detection for channel V18F */
#define CRG_TOP_BOD_V18P_EN                        (1U << 4) /* Enable brown-out detection for channel V18P */
#define CRG_TOP_BOD_V18_EN                         (1U << 3) /* Enable brown-out detection for channel V18 */
#define CRG_TOP_BOD_V14_EN                         (1U << 2) /* Enable brown-out detection for channel V14 */
#define CRG_TOP_BOD_V12_EN                         (1U << 1) /* Enable brown-out detection for channel VDD (V12) */
#define CRG_TOP_BOD_STATUS_CLEAR                   (1U << 0) /* Clears BOD_STATUS_REG when this bit is 1 for more than 2 ms. It must be 0 to reg */

/* BOD_STATUS Register */

#define CRG_TOP_BOD_VBUS                           (1U << 8) /* 1: below trigger level (BOD event) 0: above trigger level */
#define CRG_TOP_BOD_VBAT                           (1U << 7) /* 1: below trigger level (BOD event) 0: above trigger level */
#define CRG_TOP_BOD_VSYS                           (1U << 5) /* 1: below trigger level (BOD event) 0: above trigger level */
#define CRG_TOP_BOD_V18F                           (1U << 4) /* 1: below trigger level (BOD event) 0: above trigger level */
#define CRG_TOP_BOD_V18P                           (1U << 3) /* 1: below trigger level (BOD event) 0: above trigger level */
#define CRG_TOP_BOD_V18                            (1U << 2) /* 1: below trigger level (BOD event) 0: above trigger level */
#define CRG_TOP_BOD_V14                            (1U << 1) /* 1: below trigger level (BOD event) 0: above trigger level */
#define CRG_TOP_BOD_V12                            (1U << 0) /* 1: below trigger level (BOD event) 0: above trigger level */

