AlmAck/svdtonuttx/demo/h/da1470x_crg_top.h
/* CLK_AMBA Register */

#define CRG_TOP_OQSPI_PULLUP_ENABLE                (1U << 20) /* Selects pull value when OQSPIF_D* pads are not output. 0: The pads are pull-down */
#define CRG_TOP_OQSPI_GPIO_MODE                    (1U << 19) /* If this bit is set, the upper 4 pins of the OQSPIF controller can be used as GPI */
#define CRG_TOP_QSPIC2_ENABLE                      (1U << 18) /* Clock enable for QSPI RAM controller */
#define CRG_TOP_QSPIC2_DIV_MASK                    (0x3 << 16) /* Clock divider setting. 0b00: divide by 1 0b01: divide by 2 0b10: divide by 4 0b1 */
#define CRG_TOP_QSPIC2_DIV_POS                     (16) /* Clock divider setting. 0b00: divide by 1 0b01: divide by 2 0b10: divide by 4 0b1 */
#define CRG_TOP_QSPIC_ENABLE                       (1U << 15) /* Clock enable for QSPI FLASH2 controller */
#define CRG_TOP_QSPIC_DIV_MASK                     (0x3 << 13) /* Clock divider setting. 0b00: divide by 1 0b01: divide by 2 0b10: divide by 4 0b1 */
#define CRG_TOP_QSPIC_DIV_POS                      (13) /* Clock divider setting. 0b00: divide by 1 0b01: divide by 2 0b10: divide by 4 0b1 */
#define CRG_TOP_OQSPIF_ENABLE                      (1U << 12) /* Clock enable for Octal SPI controller */
#define CRG_TOP_OQSPIF_DIV_MASK                    (0x3 << 10) /* Clock divider setting. 0b00: divide by 1 0b01: divide by 2 0b10: divide by 4 0b1 */
#define CRG_TOP_OQSPIF_DIV_POS                     (10) /* Clock divider setting. 0b00: divide by 1 0b01: divide by 2 0b10: divide by 4 0b1 */
#define CRG_TOP_OTP_ENABLE                         (1U << 9) /* Clock enable for OTP controller */
#define CRG_TOP_AES_CLK_ENABLE                     (1U << 8) /* Clock enable for AES crypto block */
#define CRG_TOP_SLOW_PCLK_DIV_MASK                 (0x7 << 5) /* Slow-APB interface clock, derived from DIVN_CLK: 0b000: divide divn_clk by 1 0b0 */
#define CRG_TOP_SLOW_PCLK_DIV_POS                  (5) /* Slow-APB interface clock, derived from DIVN_CLK: 0b000: divide divn_clk by 1 0b0 */
#define CRG_TOP_PCLK_DIV_MASK                      (0x3 << 3) /* Fast-APB interface clock, Cascaded with HCLK: 0b00: divide hclk by 1 0b01: divid */
#define CRG_TOP_PCLK_DIV_POS                       (3) /* Fast-APB interface clock, Cascaded with HCLK: 0b00: divide hclk by 1 0b01: divid */
#define CRG_TOP_HCLK_DIV_MASK                      (0x7 << 0) /* AHB interface and microprocessor clock. Source clock divided by: 0b000: divide c */
#define CRG_TOP_HCLK_DIV_POS                       (0) /* AHB interface and microprocessor clock. Source clock divided by: 0b000: divide c */

/* CLK_CMAC_SWITCH Register */

#define CRG_TOP_CMAC_RUNNING_ON_XTAL               (1U << 2) /* This bit is 1 when the CMAC_CLK is enabled, and the switch is set in the XTAL32M */
#define CRG_TOP_CMAC_RUNNING_ON_DIVN               (1U << 1) /* This bit is 1 when the CMAC_CLK is enabled, and the switch is set in the DIVN_CL */
#define CRG_TOP_CMAC_CLK_SEL                       (1U << 0) /* Selects the clock source of the CMAC_CLK. 0: DIVN_CLK is selected 1: XTAL32M is  */

/* CLK_CTRL Register */

#define CRG_TOP_RUNNING_AT_PLL                     (1U << 15) /* Indicates that the PLL clock is used as clock, and may not be switched off */
#define CRG_TOP_RUNNING_AT_XTAL32M                 (1U << 14) /* Indicates that the XTAL32M clock is used as clock, and may not be switched off */
#define CRG_TOP_RUNNING_AT_RCHS                    (1U << 13) /* Indicates that the RCHS clock is used as clock */
#define CRG_TOP_RUNNING_AT_RCLP                    (1U << 12) /* Indicates that the RCLP_CLK is being used as clock */
#define CRG_TOP_VAD_CLK_SEL                        (1U << 6) /* Selects the clock for the VAD. 0: Select RCLP clock (normalized for ~32 kHz) 1:  */
#define CRG_TOP_USB_CLK_SRC                        (1U << 4) /* Selects the USB source clock 0 : USB PLL 48 MHz clk 1 : DIVN clk, to be used in  */
#define CRG_TOP_LP_CLK_SEL_MASK                    (0x3 << 2) /* Sets the clock source of the LowerPower clock 0x0: RCLP 0x1: RCX 0x2: XTAL32K th */
#define CRG_TOP_LP_CLK_SEL_POS                     (2) /* Sets the clock source of the LowerPower clock 0x0: RCLP 0x1: RCX 0x2: XTAL32K th */
#define CRG_TOP_SYS_CLK_SEL_MASK                   (0x3 << 0) /* Selects the clock source. 0x0 : XTAL32M 0x1 : RCHS 0x2 : RCLP 0x3 : The PLL 160  */
#define CRG_TOP_SYS_CLK_SEL_POS                    (0) /* Selects the clock source. 0x0 : XTAL32M 0x1 : RCHS 0x2 : RCLP 0x3 : The PLL 160  */

/* CLK_RADIO Register */

#define CRG_TOP_RAD_REG_RESET_REQ                  (1U << 6) /* Reset request for registers of the radio PHY. */
#define CRG_TOP_RFCU_ENABLE                        (1U << 5) /* Enable the RF control Unit clock */
#define CRG_TOP_CMAC_SYNCH_RESET                   (1U << 4) /* Force synchronous reset to CMAC core and Sleep Timer. Its effective only when bo */
#define CRG_TOP_CMAC_CLK_ENABLE                    (1U << 2) /* Enables the clock */

/* CLK_RCHS Register */

#define CRG_TOP_RCHS_SPEED_MASK                    (0x3 << 22) /* Selects speed of RCHS output 0b00: 32 MHz, by dividing 96 / 3. 0b01: 96 MHz, by  */
#define CRG_TOP_RCHS_SPEED_POS                     (22) /* Selects speed of RCHS output 0b00: 32 MHz, by dividing 96 / 3. 0b01: 96 MHz, by  */
#define CRG_TOP_RCHS_INIT_RANGE_MASK               (0x3 << 20) /* Course frequency adjustment */
#define CRG_TOP_RCHS_INIT_RANGE_POS                (20) /* Course frequency adjustment */
#define CRG_TOP_RCHS_INIT_DEL_MASK                 (0xFF << 12) /* Fine frequency adjustment */
#define CRG_TOP_RCHS_INIT_DEL_POS                  (12) /* Fine frequency adjustment */
#define CRG_TOP_RCHS_INIT_DTCF_MASK                (0x7 << 9) /* Fine duty-cycle adjustment. 0x0: minimum 0x2: default 0x4: maximum 0x5 until 0x7 */
#define CRG_TOP_RCHS_INIT_DTCF_POS                 (9) /* Fine duty-cycle adjustment. 0x0: minimum 0x2: default 0x4: maximum 0x5 until 0x7 */
#define CRG_TOP_RCHS_INIT_DTC_MASK                 (0xF << 5) /* Course duty-cycle adjustment. 0x0: minimum 0x5: default 0xA: maximum 0xB until 0 */
#define CRG_TOP_RCHS_INIT_DTC_POS                  (5) /* Course duty-cycle adjustment. 0x0: minimum 0x5: default 0xA: maximum 0xB until 0 */
#define CRG_TOP_RCHS_BIAS_MASK                     (0xF << 1) /* Bias adjustment. Avoid higher bias trim settings (for example, 0xF), the resulti */
#define CRG_TOP_RCHS_BIAS_POS                      (1) /* Bias adjustment. Avoid higher bias trim settings (for example, 0xF), the resulti */
#define CRG_TOP_RCHS_ENABLE                        (1U << 0) /* Enables the HighSpeed RC oscillator. Setting this bit will always-enable the osc */

/* CLK_RCLP Register */

#define CRG_TOP_RCLP_LOW_SPEED_FORCE               (1U << 5) /* Forces RCLP in 32-kHz mode. If this bit is 0 then RCLP frequency is 512 kHz */
#define CRG_TOP_RCLP_TRIM_MASK                     (0xF << 1) /* 0000 = lowest frequency 0111 = default 1111 = highest frequency */
#define CRG_TOP_RCLP_TRIM_POS                      (1) /* 0000 = lowest frequency 0111 = default 1111 = highest frequency */
#define CRG_TOP_RCLP_ENABLE                        (1U << 0) /* Enables the 32-kHz RC oscillator. Do not disable this bit, as deep/extended slee */

/* CLK_RCX Register */

#define CRG_TOP_RCX_BIAS_MASK                      (0xF << 8) /* LDO bias current. 0x0: minimum 0xF: maximum */
#define CRG_TOP_RCX_BIAS_POS                       (8) /* LDO bias current. 0x0: minimum 0xF: maximum */
#define CRG_TOP_RCX_C0                             (1U << 7) /* Add unit capacitance to RC-time delay. */
#define CRG_TOP_RCX_CADJUST_MASK                   (0x1F << 2) /* Adjust capacitance part of RC-time delay. 0x00: minimum capacitance 0x1F: maximu */
#define CRG_TOP_RCX_CADJUST_POS                    (2) /* Adjust capacitance part of RC-time delay. 0x00: minimum capacitance 0x1F: maximu */
#define CRG_TOP_RCX_ENABLE                         (1U << 0) /* 0: Disable the RCX oscillator (watchdog runs at RCLP) 1: Enable the RCX oscillat */

/* CLK_RTCDIV Register */

