AlmAck/svdtonuttx/demo/h/da1470x_crg_top.h
#define CRG_TOP_RTC_RESET_REQ                      (1U << 21) /* Reset request for the RTC module */
#define CRG_TOP_RTC_DIV_ENABLE                     (1U << 20) /* Enable for the 100 Hz generation for the RTC block */
#define CRG_TOP_RTC_DIV_DENOM                      (1U << 19) /* Selects the denominator for the fractional division: 0b0: 1000 0b1: 1024 */
#define CRG_TOP_RTC_DIV_INT_MASK                   (0x1FF << 10) /* Integer divisor part for RTC 100 Hz generation */
#define CRG_TOP_RTC_DIV_INT_POS                    (10) /* Integer divisor part for RTC 100 Hz generation */
#define CRG_TOP_RTC_DIV_FRAC_MASK                  (0x3FF << 0) /* Fractional divisor part for RTC 100 Hz generation. if RTC_DIV_DENOM=1, <RTC_DIV_ */
#define CRG_TOP_RTC_DIV_FRAC_POS                   (0) /* Fractional divisor part for RTC 100 Hz generation. if RTC_DIV_DENOM=1, <RTC_DIV_ */

/* CLK_SNC_CTRL Register */

#define CRG_TOP_SNC_STATE_RETAINED                 (1U << 2) /* A flag which can be used from FW to indicate that the CPU state has been retaine */
#define CRG_TOP_SNC_CLK_ENABLE                     (1U << 1) /* Clock-enable for the CM0plus in the SNC. */
#define CRG_TOP_SNC_RESET_REQ                      (1U << 0) /* Force the SNC microprocessor in reset. */

/* CLK_SWITCH2XTAL Register */

#define CRG_TOP_SWITCH2XTAL                        (1U << 0) /* When writing to this register, the clock switch will happen from RC32M to XTAL32 */

/* CLK_TMR Register */

#define CRG_TOP_WAKEUPCT_ENABLE                    (1U << 0) /* Enables the clock */

/* CLK_XTAL32K Register */

#define CRG_TOP_XTAL32K_DISABLE_OUTPUT             (1U << 9) /* Disables output buffer, test only */
#define CRG_TOP_XTAL32K_DISABLE_AMPREG             (1U << 7) /* Setting this bit disables the amplitude regulation of the XTAL32kHz oscillator.  */
#define CRG_TOP_XTAL32K_CUR_MASK                   (0xF << 3) /* Bias current for the 32-kHz XTAL oscillator. 0000 is minimum, 1111 is maximum, 0 */
#define CRG_TOP_XTAL32K_CUR_POS                    (3) /* Bias current for the 32-kHz XTAL oscillator. 0000 is minimum, 1111 is maximum, 0 */
#define CRG_TOP_XTAL32K_RBIAS_MASK                 (0x3 << 1) /* Setting for the bias resistor. 00 is maximum, 11 is minimum. Prefered setting wi */
#define CRG_TOP_XTAL32K_RBIAS_POS                  (1) /* Setting for the bias resistor. 00 is maximum, 11 is minimum. Prefered setting wi */
#define CRG_TOP_XTAL32K_ENABLE                     (1U << 0) /* Enables the 32-kHz XTAL oscillator */

/* DISCHARGE_RAIL Register */

#define CRG_TOP_RESET_V18F                         (1U << 5) /* 1: enables immediate discharging of the V18F rail. Note that the source is not d */
#define CRG_TOP_RESET_V30                          (1U << 3) /* 1: enables immediate discharging of the V30 rail. Note that the source is not di */
#define CRG_TOP_RESET_V18P                         (1U << 2) /* 1: enables immediate discharging of the V18P rail. Note that the source is not d */
#define CRG_TOP_RESET_V18                          (1U << 1) /* 1: enables immediate discharging of the V18 rail. Note that the source is not di */
#define CRG_TOP_RESET_V14                          (1U << 0) /* 1: enables immediate discharging of the V14 rail. Note that the source is not di */

/* LCD_EXT_CTRL Register */

#define CRG_TOP_LCD_EXT_CLK_EN                     (1U << 10) /* No description available. */
#define CRG_TOP_LCD_EXT_CNT_RELOAD_MASK            (0x3FF << 0) /* Reload value for LCD_EXT_CLK generation. When the counter hits 0x0, it is reload */
#define CRG_TOP_LCD_EXT_CNT_RELOAD_POS             (0) /* Reload value for LCD_EXT_CLK generation. When the counter hits 0x0, it is reload */

/* P0_PAD_LATCH Register */

#define CRG_TOP_P0_LATCH_EN_MASK                   (0xFFFFFFFF << 0) /* Direct write to the individual pad latching signals. Latches the control signals */
#define CRG_TOP_P0_LATCH_EN_POS                    (0) /* Direct write to the individual pad latching signals. Latches the control signals */

/* P0_RESET_PAD_LATCH Register */

#define CRG_TOP_P0_RESET_LATCH_EN_MASK             (0xFFFFFFFF << 0) /* Direct Reset of the marked bits. Reading returns 0x0. */
#define CRG_TOP_P0_RESET_LATCH_EN_POS              (0) /* Direct Reset of the marked bits. Reading returns 0x0. */

/* P0_SET_PAD_LATCH Register */

#define CRG_TOP_P0_SET_LATCH_EN_MASK               (0xFFFFFFFF << 0) /* Direct Set of the marked bits. Reading returns 0x0. */
#define CRG_TOP_P0_SET_LATCH_EN_POS                (0) /* Direct Set of the marked bits. Reading returns 0x0. */

/* P1_PAD_LATCH Register */

#define CRG_TOP_P1_LATCH_EN_MASK                   (0xFFFFFFFF << 0) /* Direct write to the individual pad latching signals. Latches the control signals */
#define CRG_TOP_P1_LATCH_EN_POS                    (0) /* Direct write to the individual pad latching signals. Latches the control signals */

/* P1_RESET_PAD_LATCH Register */

#define CRG_TOP_P1_RESET_LATCH_EN_MASK             (0xFFFFFFFF << 0) /* Direct Reset of the marked bits. Reading returns 0x0. */
#define CRG_TOP_P1_RESET_LATCH_EN_POS              (0) /* Direct Reset of the marked bits. Reading returns 0x0. */

/* P1_SET_PAD_LATCH Register */

#define CRG_TOP_P1_SET_LATCH_EN_MASK               (0xFFFFFFFF << 0) /* Direct Set of the marked bits. Reading returns 0x0. */
#define CRG_TOP_P1_SET_LATCH_EN_POS                (0) /* Direct Set of the marked bits. Reading returns 0x0. */

/* P2_PAD_LATCH Register */

#define CRG_TOP_P2_LATCH_EN_MASK                   (0x7FFF << 0) /* Direct write to the individual pad latching signals. Latches the control signals */
#define CRG_TOP_P2_LATCH_EN_POS                    (0) /* Direct write to the individual pad latching signals. Latches the control signals */

/* P2_RESET_PAD_LATCH Register */

#define CRG_TOP_P2_RESET_LATCH_EN_MASK             (0x7FFF << 0) /* Direct Reset of the marked bits. Reading returns 0x0. */
#define CRG_TOP_P2_RESET_LATCH_EN_POS              (0) /* Direct Reset of the marked bits. Reading returns 0x0. */

/* P2_SET_PAD_LATCH Register */

#define CRG_TOP_P2_SET_LATCH_EN_MASK               (0x7FFF << 0) /* Direct Set of the marked bits. Reading returns 0x0. */
#define CRG_TOP_P2_SET_LATCH_EN_POS                (0) /* Direct Set of the marked bits. Reading returns 0x0. */

/* PMU_CTRL Register */

#define CRG_TOP_RETAIN_RGP_RAM                     (1U << 13) /* Retain the R-G-B RAMs inside the LCD display controller */
#define CRG_TOP_RETAIN_GPU_CLUT                    (1U << 12) /* Retain the GPU CLUT memory */
#define CRG_TOP_RETAIN_DCACHE                      (1U << 11) /* Selects the retainability of the dcache block while PD_CTRL is off. 1 is retaina */
#define CRG_TOP_GPU_SLEEP                          (1U << 10) /* Put the GPU power domain (PD_GPU) in powerdown */
#define CRG_TOP_CTRL_SLEEP                         (1U << 9) /* Put the Controller power domain (PD_CTRL) in powerdown */
#define CRG_TOP_RETAIN_CACHE                       (1U << 7) /* Selects the retainability of the cache block during deep sleep. 1 is retainable, */
#define CRG_TOP_SYS_SLEEP                          (1U << 6) /* Put the System powerdomain (PD_SYS) in powerdown. If this bit is 1, and there is */
#define CRG_TOP_RESET_ON_WAKEUP                    (1U << 5) /* Perform a Hardware Reset after waking up. Booter will be started. */
#define CRG_TOP_SNC_SLEEP                          (1U << 3) /* Put the Communications powerdomain (PD_SNC) in powerdown */
#define CRG_TOP_TIM_SLEEP                          (1U << 2) /* Put the Timers Powerdomain (PD_TIM) in powerdown. */
#define CRG_TOP_RADIO_SLEEP                        (1U << 1) /* Put the digital part of the radio, including CMAC (PD_RAD) in powerdown */
#define CRG_TOP_AUD_SLEEP                          (1U << 0) /* Put the audio power domain (PD_AUD) in powerdown */

/* PMU_SLEEP Register */

#define CRG_TOP_ULTRA_FAST_WAKEUP                  (1U << 31) /* Allows the core to start running on the RC32M while the PMU is still waiting for */
#define CRG_TOP_ENABLE_FAST_SWITCH                 (1U << 30) /* Enables early clock switching upon event detection to speed up the wake-up time */
#define CRG_TOP_VLED_BYPASS_REFRESH_TIME_MASK      (0x7F << 23) /* Determines how long the VLED bypass switch is closed when VSYS near VLED flag an */
#define CRG_TOP_VLED_BYPASS_REFRESH_TIME_POS       (23) /* Determines how long the VLED bypass switch is closed when VSYS near VLED flag an */
#define CRG_TOP_BOD_SLEEP_INTERVAL_MASK            (0xF << 19) /* This is the interval at which the BOD comparators/POR will be checked during sle */
#define CRG_TOP_BOD_SLEEP_INTERVAL_POS             (19) /* This is the interval at which the BOD comparators/POR will be checked during sle */
#define CRG_TOP_RAILS_REFRESH_INTERVAL_MASK        (0x3FFF << 5) /* This is the interval at which the power rails reference voltage will be refreshe */
#define CRG_TOP_RAILS_REFRESH_INTERVAL_POS         (5) /* This is the interval at which the power rails reference voltage will be refreshe */
#define CRG_TOP_BASE_REFRESH_INTERVAL_MASK         (0x1F << 0) /* This sets the base time for calculating the intervals at which PMU refreshes dur */
#define CRG_TOP_BASE_REFRESH_INTERVAL_POS          (0) /* This sets the base time for calculating the intervals at which PMU refreshes dur */

/* POR_CTRL Register */

#define CRG_TOP_POR_VSYS_SLEEP_CYCLE_EN            (1U << 11) /* Enables POR_VSYS during BOD check cycles in sleep (If POR_VSYS_DISABLE = 0) */
#define CRG_TOP_POR_VSYS_HYST_SEL                  (1U << 10) /* Selects POR_VSYS threshold level, when hysteresis is disabled (see POR_VSYS_DISA */
#define CRG_TOP_POR_VSYS_HYST_DISABLE              (1U << 9) /* Disable POR_VSYS hysteresis. */
#define CRG_TOP_POR_VSYS_FORCE_ON                  (1U << 8) /* FORCE POR_VSYS to be ON (also in SLEEP) */
#define CRG_TOP_POR_VSYS_MASK                      (1U << 7) /* Mask POR on VSYS */
#define CRG_TOP_POR_VSYS_DISABLE                   (1U << 6) /* Disable POR_VSYS */
#define CRG_TOP_POR_V30_SLEEP_CYCLE_EN             (1U << 5) /* Enables POR_V30 during BOD check cycles in sleep (If POR_V30_DISABLE = 0) */
#define CRG_TOP_POR_V30_HYST_SEL                   (1U << 4) /* Selects POR_VDDA_3V0 threshold level, when hysteresis is disabled (see POR_VDDA_ */
#define CRG_TOP_POR_V30_HYST_DISABLE               (1U << 3) /* Disable POR_VDDA_3V0 hysteresis; select level with POR_VDDA_3V0_HYST_SEL */
#define CRG_TOP_POR_V30_FORCE_ON                   (1U << 2) /* Force POR_VDDA_3V0 always ON, (also in SLEEP) */
#define CRG_TOP_POR_V30_MASK                       (1U << 1) /* Mask POR_VDDA_3V0 */
#define CRG_TOP_POR_V30_DISABLE                    (1U << 0) /* Disable POR_VDDA_3V0 */

/* POR_PIN Register */

#define CRG_TOP_POR_PIN_POLARITY                   (1U << 7) /* 0: Active Low 1: Active High Note: This applies only for the GPIO pin. Reset pad */
#define CRG_TOP_POR_PIN_SELECT_MASK                (0x7F << 0) /* 0x00: P0_00 ... 0x1f: P0_31 0x20: P1_00 ... 0x3F: P1_31 0x40: P2_00 ... 0x4E: P2 */
#define CRG_TOP_POR_PIN_SELECT_POS                 (0) /* 0x00: P0_00 ... 0x1f: P0_31 0x20: P1_00 ... 0x3F: P1_31 0x40: P2_00 ... 0x4E: P2 */

/* POR_TIMER Register */

#define CRG_TOP_POR_TIME_MASK                      (0x7F << 0) /* Time for the POReset to happen. Formula: Time = POR_TIME x 4096 x RC32 clock per */
#define CRG_TOP_POR_TIME_POS                       (0) /* Time for the POReset to happen. Formula: Time = POR_TIME x 4096 x RC32 clock per */

