AlmAck/svdtonuttx/demo/h/da1470x_crg_top.h
/* POWER_CTRL Register */

#define CRG_TOP_EN_RCX_SUPPLY_BIAS                 (1U << 27) /* RCX supply bias switch for calibration. This bit needs to be 0 before entering h */
#define CRG_TOP_DCDC_BOOST_CLAMP_EN                (1U << 24) /* Enables clamp circuit between V_LED and ground in the boost converter to bleed o */
#define CRG_TOP_SW_V18F_SLEEP_ON                   (1U << 19) /* Closes the V18F switch in sleep when DCDC_V18P_SLEEP_EN is 1. See SW_V18F regist */
#define CRG_TOP_SW_V18F_ON                         (1U << 18) /* Closes the V18F switch when DCDC_V18P_EN is 1. See SW_V18F register for more set */
#define CRG_TOP_DCDC_VLED_SLEEP_EN                 (1U << 17) /* Enables boost dcdc led rail in sleep mode */
#define CRG_TOP_DCDC_VLED_EN                       (1U << 16) /* Enables boost dcdc led rail in active mode */
#define CRG_TOP_DCDC_V18P_SLEEP_EN                 (1U << 15) /* Enables buck dcdc V18p rail in sleep mode */
#define CRG_TOP_DCDC_V18P_EN                       (1U << 14) /* Enables buck dcdc V18p rail in active mode */
#define CRG_TOP_DCDC_V18_SLEEP_EN                  (1U << 13) /* Enables buck dcdc V18 rail in sleep mode */
#define CRG_TOP_DCDC_V18_EN                        (1U << 12) /* Enables buck dcdc V18 rail in active mode */
#define CRG_TOP_DCDC_V14_SLEEP_EN                  (1U << 11) /* Enables buck dcdc V14 rail in sleep mode */
#define CRG_TOP_DCDC_V14_EN                        (1U << 10) /* Enables buck dcdc V14 rail in active mode */
#define CRG_TOP_DCDC_V12_SLEEP_EN                  (1U << 9) /* Enables buck dcdc V12 rail in sleep mode */
#define CRG_TOP_DCDC_V12_EN                        (1U << 8) /* Enables buck dcdc V12 rail in active mode */
#define CRG_TOP_CLAMP_V12_DIS                      (1U << 7) /* Disables V12 clamp. During Hibernation, V12 clamp will be enabled regardless of  */
#define CRG_TOP_CLAMP_V30_EN                       (1U << 6) /* Enables V30 clamp. */
#define CRG_TOP_LDO_RET_V30_SLEEP_EN               (1U << 4) /* Enables ldo V30 ret in sleep mode */
#define CRG_TOP_LDO_RET_V30_EN                     (1U << 3) /* Enables ldo V30 ret in active mode */
#define CRG_TOP_LDO_V30_SLEEP_EN                   (1U << 2) /* Enables ldo V30 in sleep mode */
#define CRG_TOP_LDO_V30_EN                         (1U << 1) /* Enables ldo V30 in active mode */
#define CRG_TOP_LDO_START_DISABLE                  (1U << 0) /* Disables ldo start. */

/* POWER_LVL Register */

#define CRG_TOP_VSYS_LEVEL_MASK                    (0x3 << 17) /* Level setting for VSYS rail when ldo_vsys is enabled (COMP_VBUS_OK & COMP_VBUS_A */
#define CRG_TOP_VSYS_LEVEL_POS                     (17) /* Level setting for VSYS rail when ldo_vsys is enabled (COMP_VBUS_OK & COMP_VBUS_A */
#define CRG_TOP_V18_LEVEL                          (1U << 16) /* Level setting for V18 rail: 0: 1.2 V 1: 1.8 V */
#define CRG_TOP_V14_LEVEL_MASK                     (0x3 << 14) /* Level setting for V14 rail: 0: 1.2 V 1: 1.3 V 2: 1.4 V 3: 1.5 V */
#define CRG_TOP_V14_LEVEL_POS                      (14) /* Level setting for V14 rail: 0: 1.2 V 1: 1.3 V 2: 1.4 V 3: 1.5 V */
#define CRG_TOP_V12_SLEEP_LEVEL_MASK               (0x3 << 12) /* Level setting for V12 rail in sleep: 0: 0.75 V 1: 0.9 V 2: 1.2 V 3: reserved */
#define CRG_TOP_V12_SLEEP_LEVEL_POS                (12) /* Level setting for V12 rail in sleep: 0: 0.75 V 1: 0.9 V 2: 1.2 V 3: reserved */
#define CRG_TOP_V12_LEVEL_MASK                     (0x3 << 10) /* Level setting for V12 rail: 0: 0.75 V 1: 0.9 V 2: 1.2 V 3: reserved */
#define CRG_TOP_V12_LEVEL_POS                      (10) /* Level setting for V12 rail: 0: 0.75 V 1: 0.9 V 2: 1.2 V 3: reserved */
#define CRG_TOP_V30_SLEEP_LEVEL_MASK               (0x3 << 8) /* Level setting for V30 in sleep: 0x0: 3.0 V 0x1: reserved 0x2: 3.3 V 0x3: 3.3 V */
#define CRG_TOP_V30_SLEEP_LEVEL_POS                (8) /* Level setting for V30 in sleep: 0x0: 3.0 V 0x1: reserved 0x2: 3.3 V 0x3: 3.3 V */
#define CRG_TOP_V30_LEVEL_MASK                     (0x3 << 6) /* Level setting for V30: 0x0: 3.0 V 0x1: reserved 0x2: 3.3 V 0x3: 3.3 V */
#define CRG_TOP_V30_LEVEL_POS                      (6) /* Level setting for V30: 0x0: 3.0 V 0x1: reserved 0x2: 3.3 V 0x3: 3.3 V */

/* RAM_PWR_CTRL Register */

#define CRG_TOP_RAM13_PWR_CTRL_MASK                (0x3 << 26) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM13_PWR_CTRL_POS                 (26) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM12_PWR_CTRL_MASK                (0x3 << 24) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM12_PWR_CTRL_POS                 (24) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM11_PWR_CTRL_MASK                (0x3 << 22) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM11_PWR_CTRL_POS                 (22) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM10_PWR_CTRL_MASK                (0x3 << 20) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM10_PWR_CTRL_POS                 (20) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM9_PWR_CTRL_MASK                 (0x3 << 18) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM9_PWR_CTRL_POS                  (18) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM8_PWR_CTRL_MASK                 (0x3 << 16) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM8_PWR_CTRL_POS                  (16) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM7_PWR_CTRL_MASK                 (0x3 << 14) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM7_PWR_CTRL_POS                  (14) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM6_PWR_CTRL_MASK                 (0x3 << 12) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM6_PWR_CTRL_POS                  (12) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM5_PWR_CTRL_MASK                 (0x3 << 10) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM5_PWR_CTRL_POS                  (10) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM4_PWR_CTRL_MASK                 (0x3 << 8) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM4_PWR_CTRL_POS                  (8) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM3_PWR_CTRL_MASK                 (0x3 << 6) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM3_PWR_CTRL_POS                  (6) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM2_PWR_CTRL_MASK                 (0x3 << 4) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM2_PWR_CTRL_POS                  (4) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM1_PWR_CTRL_MASK                 (0x3 << 2) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM1_PWR_CTRL_POS                  (2) /* See description of RAM0_PWR_CTRL. */
#define CRG_TOP_RAM0_PWR_CTRL_MASK                 (0x3 << 0) /* Power state control of the individual RAMs. May only change when the memory isn' */
#define CRG_TOP_RAM0_PWR_CTRL_POS                  (0) /* Power state control of the individual RAMs. May only change when the memory isn' */

/* RESET_STAT Register */

#define CRG_TOP_SNC_WDOGRESET_STAT                 (1U << 6) /* Indicates that a SNC-Watchdog timeout has happened. Note that it is also set whe */
#define CRG_TOP_CMAC_WDOGRESET_STAT                (1U << 5) /* Indicates that a CMAC-Watchdog timeout has happened. Note that it is also set wh */
#define CRG_TOP_SWD_HWRESET_STAT                   (1U << 4) /* Indicates that a write to SWD_RESET_REG has happened. Note that it is also set w */
#define CRG_TOP_WDOGRESET_STAT                     (1U << 3) /* Indicates that a Watchdog timeout has happened. Note that it is also set when a  */
#define CRG_TOP_SWRESET_STAT                       (1U << 2) /* Indicates that a SW Reset has happened */
#define CRG_TOP_HWRESET_STAT                       (1U << 1) /* Indicates that a HW Reset has happened */
#define CRG_TOP_PORESET_STAT                       (1U << 0) /* Indicates that a PowerOn Reset has happened. All bitfields of RESET_STAT_REG sho */

/* RST_CTRL Register */

#define CRG_TOP_SYS_CACHE_FLUSH_WITH_SW_RESET      (1U << 0) /* 0: Flush the System Cache memory only at HW reset. 1: Flush the System Cache mem */

/* SECURE_BOOT Register */

#define CRG_TOP_PROT_OTP_CS_WRITE                  (1U << 9) /* This bit will permanentlly disable any write action to the CS inside the OTP */
#define CRG_TOP_FORCE_SNC_DEBUGGER_OFF             (1U << 8) /* This bit will permanently disable the SNC debugger */
#define CRG_TOP_PROT_OQSPIF_KEY_READ               (1U << 7) /* This bit will permanently disable CPU read capability at OTP offset 0x00000B00 a */
#define CRG_TOP_PROT_OQSPIF_KEY_WRITE              (1U << 6) /* This bit will permanently disable ANY write capability at OTP offset 0x00000B00  */
#define CRG_TOP_PROT_AES_KEY_READ                  (1U << 5) /* This bit will permanently disable CPU read capability at OTP offset 0x00000A00 a */
#define CRG_TOP_PROT_AES_KEY_WRITE                 (1U << 4) /* This bit will permanently disable ANY write capability at OTP offset 0x00000A00  */
#define CRG_TOP_PROT_SIG_KEY_WRITE                 (1U << 3) /* This bit will permanently disable ANY write capability at OTP offset 0x000008C0  */
#define CRG_TOP_FORCE_CMAC_DEBUGGER_OFF            (1U << 2) /* This bit will permanently disable the CMAC debugger */
#define CRG_TOP_FORCE_DEBUGGER_OFF                 (1U << 1) /* Follows the respective OTP flag value. Its value is updated by the BootROM code. */
#define CRG_TOP_SECURE_BOOT                        (1U << 0) /* Follows the respective OTP flag value. Its value is updated by the BootROM code. */

