AlmAck/svdtonuttx/demo/h/da1470x_crg_top.h
/* SLP_MAP Register */

#define CRG_TOP_LCD_INV_EXT_CLK_SLP_MAP            (1U << 8) /* Maps inverted LCD_EXT_CLK on P0_10, for LCD XFRP function This state is preserve */
#define CRG_TOP_LCD_EXT_CLK_SLP_MAP                (1U << 7) /* Maps LCD_EXT_CLK on P0_19, for LCD VCOM/FRP/EXTCOMIN function This state is pres */
#define CRG_TOP_BANDGAP_SLP_MAP                    (1U << 6) /* Setting this bit will:  - map bandgap_enable to P0_20 - map (wokenup OR cmac_slp */
#define CRG_TOP_RCLP_SLP_MAP                       (1U << 5) /* Maps RCLP onto P1_23. This state is preserved during deep sleep, to allow pin ou */
#define CRG_TOP_XTAL32K_SLP_MAP                    (1U << 4) /* Maps XTA32k onto P0_31. This state is preserved during deep sleep, to allow pin  */
#define CRG_TOP_RCX_SLP_MAP                        (1U << 3) /* Maps RCX onto P1_22. This state is preserved during deep sleep, to allow pin out */
#define CRG_TOP_TMR4_PWM_SLP_MAP                   (1U << 2) /* Maps Timer4_pwm onto P1_31 This state is preserved during deep sleep, to allow p */
#define CRG_TOP_TMR3_PWM_SLP_MAP                   (1U << 1) /* Maps Timer3_pwm onto P1_30 This state is preserved during deep sleep, to allow p */
#define CRG_TOP_TMR_PWM_SLP_MAP                    (1U << 0) /* Maps Timer1_pwm onto P0_30 This state is preserved during deep sleep, to allow p */

/* SW_V18F Register */

#define CRG_TOP_DELAY_TRIM_MASK                    (0x3 << 2) /* Soft start delay trim */
#define CRG_TOP_DELAY_TRIM_POS                     (2) /* Soft start delay trim */
#define CRG_TOP_SKIP_SOFT_START                    (1U << 1) /* Skip soft start routine */
#define CRG_TOP_FORCE_SW_ON                        (1U << 0) /* Forces closing sw_V18f, independent of v18p state */

/* SYS_CTRL Register */

#define CRG_TOP_SW_RESET                           (1U << 15) /* Writing a 1 to this bit will generate a SW_RESET. */
#define CRG_TOP_CACHERAM_MUX                       (1U << 10) /* Controls accessiblity of Cache RAM (incl. enabling/disabling of the Cache Contro */
#define CRG_TOP_TIMEOUT_DISABLE                    (1U << 9) /* Disables timeout in Power statemachine. By default, the statemachine continues i */
#define CRG_TOP_DEBUGGER_ENABLE                    (1U << 7) /* Enable the debugger. This bit is set by the booter according to the OTP header.  */
#define CRG_TOP_SNC_DEBUGGER_ENABLE                (1U << 5) /* Enable the SNC debugger. If not set, the SWDIO and SW_CLK can be used as gpio po */
#define CRG_TOP_REMAP_INTVECT                      (1U << 3) /* 0: normal operation 1: If ARM is in address range 0 - 0x1FF then the address is  */
#define CRG_TOP_REMAP_ADR0_MASK                    (0x7 << 0) /* Controls which memory is located at address 0x0000 for execution. 0x0: ROM 0x1:  */
#define CRG_TOP_REMAP_ADR0_POS                     (0) /* Controls which memory is located at address 0x0000 for execution. 0x0: ROM 0x1:  */

/* SYS_STAT Register */

#define CRG_TOP_GPU_IS_UP                          (1U << 17) /* Indicates that PD_GPU is functional */
#define CRG_TOP_GPU_IS_DOWN                        (1U << 16) /* Indicates that PD_GPU is in power down */
#define CRG_TOP_CTRL_IS_UP                         (1U << 15) /* Indicates that PD_CTRL is functional */
#define CRG_TOP_CTRL_IS_DOWN                       (1U << 14) /* Indicates that PD_CTRL is in power down */
#define CRG_TOP_POWER_IS_UP                        (1U << 13) /* Indicates that the Startup statemachine is finished, and all power regulation is */
#define CRG_TOP_DBG_IS_ACTIVE                      (1U << 12) /* Indicates that a debugger is attached. */
#define CRG_TOP_SNC_IS_UP                          (1U << 11) /* Indicates that PD_SNC is functional */
#define CRG_TOP_SNC_IS_DOWN                        (1U << 10) /* Indicates that PD_SNC is in power down */
#define CRG_TOP_TIM_IS_UP                          (1U << 9) /* Indicates that PD_TIM is functional */
#define CRG_TOP_TIM_IS_DOWN                        (1U << 8) /* Indicates that PD_TIM is in power down */
#define CRG_TOP_MEM_IS_UP                          (1U << 7) /* Indicates that PD_MEM is functional */
#define CRG_TOP_MEM_IS_DOWN                        (1U << 6) /* Indicates that PD_MEM is in power down */
#define CRG_TOP_SYS_IS_UP                          (1U << 5) /* Indicates that PD_SYS is functional */
#define CRG_TOP_SYS_IS_DOWN                        (1U << 4) /* Indicates that PD_SYS is in power down */
#define CRG_TOP_AUD_IS_UP                          (1U << 3) /* Indicates that PD_AUD is functional */
#define CRG_TOP_AUD_IS_DOWN                        (1U << 2) /* Indicates that PD_AUD is in power down */
#define CRG_TOP_RAD_IS_UP                          (1U << 1) /* Indicates that PD_RAD is functional */
#define CRG_TOP_RAD_IS_DOWN                        (1U << 0) /* Indicates that PD_RAD is in power down */

/* VBUS_IRQ_CLEAR Register */

#define CRG_TOP_VBUS_IRQ_CLEAR_MASK                (0xFFFF << 0) /* Writing any value to this register will reset the VBUS_IRQ line */
#define CRG_TOP_VBUS_IRQ_CLEAR_POS                 (0) /* Writing any value to this register will reset the VBUS_IRQ line */

/* VBUS_IRQ_MASK Register */

#define CRG_TOP_VBUS_IRQ_EN_RISE                   (1U << 1) /* Setting this bit to 1 enables VBUS_IRQ generation when the VBUS starts to ramp a */
#define CRG_TOP_VBUS_IRQ_EN_FALL                   (1U << 0) /* Setting this bit to 1 enables VBUS_IRQ generation when the VBUS starts to fall b */

/* WAKEUP_HIBERN Register */

#define CRG_TOP_HIBERNATION_ENABLE                 (1U << 12) /* Enable hibernation mode */
#define CRG_TOP_WAKEUP_PD_EN_MASK                  (0xF << 6) /* Enables pull-down for GPIO[n] during hibernation Bit 0: P0_20 Bit 1: P0_29 Bit 2 */
#define CRG_TOP_WAKEUP_PD_EN_POS                   (6) /* Enables pull-down for GPIO[n] during hibernation Bit 0: P0_20 Bit 1: P0_29 Bit 2 */
#define CRG_TOP_WAKEUP_EN_MASK                     (0xF << 0) /* Enables GPIO[n] to wake up from hibernation Bit 0: P0_20 Bit 1: P0_29 Bit 2: P1_ */
#define CRG_TOP_WAKEUP_EN_POS                      (0) /* Enables GPIO[n] to wake up from hibernation Bit 0: P0_20 Bit 1: P0_29 Bit 2: P1_ */

#endif /* __DA1470X_CRG_TOP_H */
